# Merging & Joining Data

Often, data is split across multiple tables or files. Pandas lets you **combine** them just like SQL â€” or even more flexibly!

---

## Sample DataFrames

```python
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})
```

---

## Merge Like SQL: `pd.merge()`

### Inner Join (default)

```python
pd.merge(employees, departments, on="DeptID")
```

Returns only matching DeptIDs:

| EmpID | Name    | DeptID | DeptName    |
|--------|---------|--------|-------------|
| 1      | Alice   | 10     | HR          |
| 2      | Bob     | 20     | Engineering |

---

### Left Join

```python
pd.merge(employees, departments, on="DeptID", how="left")
```

Keeps all employees, fills `NaN` where no match.

---

### Right Join

```python
pd.merge(employees, departments, on="DeptID", how="right")
```

Keeps all departments, even if no employee.

---

### Outer Join

```python
pd.merge(employees, departments, on="DeptID", how="outer")
```

Includes *all* data, fills missing with `NaN`.


---

## Concatenating DataFrames

Use `pd.concat()` to **stack** datasets either vertically or horizontally.

### Vertical (rows)

```python
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

pd.concat([df1, df2])
```

### Horizontal (columns)

```python
df1 = pd.DataFrame({"ID": [1, 2]})
df2 = pd.DataFrame({"Score": [90, 80]})

pd.concat([df1, df2], axis=1)
```

> Make sure indexes align when using `axis=1`

---

## When to Use What?

| Use Case                        | Method     |
|---------------------------------|------------|
| SQL-style joins (merge keys)    | `pd.merge()` or `.join()` |
| Stack datasets vertically       | `pd.concat([df1, df2])`   |
| Combine different features side-by-side | `pd.concat([df1, df2], axis=1)` |
| Align on index                 | `.join()` or merge with `right_index=True` |

---

## Summary

- Use `merge()` like SQL joins (`inner`, `left`, `right`, `outer`)  
- Use `concat()` to stack DataFrames (rows or columns)  
- Handle mismatched keys and indexes with care  
- Merging and joining are essential for real-world projects

In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [3]:
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [4]:
# i have two datafram and i want to merge them with same data on deptID
pd.merge(employees, departments, on = "DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [5]:
#if i want all employees and merge the data so use how = left if there is no match fills nan
pd.merge(employees, departments, on = "DeptID", how = "left") #dept id(30) department me nhi h so NaN
#left ka matlb jo left h like employees so uske hisab se merge hoga

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [6]:
pd.merge(employees, departments, on = "DeptID", how = "right")  #i need merge according to department where i need every row of department

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [7]:
#if i want both dataframe, with all rows then use outer
pd.merge(employees, departments, on = "DeptID", how = "outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

### concatenate two data frame

In [8]:
df1 = pd.DataFrame({"Name": ["Ayush", "Bob"]})
df2 = pd.DataFrame({"Name": ["Karan", "Chetu"]})
df1

    Name
0  Ayush
1    Bob

In [9]:
df2

    Name
0  Karan
1  Chetu

In [10]:
#concatenate vertically
pd.concat([df1,df2])

    Name
0  Ayush
1    Bob
0  Karan
1  Chetu

In [11]:
#concatenate horizontally
pd.concat([df1,df2], axis = 1)

    Name   Name
0  Ayush  Karan
1    Bob  Chetu

In [12]:
#lets say i have two different dataframe with diff paramteres in the data
df3 = pd.DataFrame({"Name" : ["ruchi", "super"], "Age" : [19, 23]})
df4 = pd.DataFrame({"Name" : ["chetu", "hero"], "Score" : [45, 90]})

In [13]:
pd.concat([df3, df4]) #it will give nan coz have two diff parameters in the data don't have sore of 1st one dataframe

    Name   Age  Score
0  ruchi  19.0    NaN
1  super  23.0    NaN
0  chetu   NaN   45.0
1   hero   NaN   90.0

In [14]:
pd.concat([df3, df4], axis = 1)

    Name  Age   Name  Score
0  ruchi   19  chetu     45
1  super   23   hero     90